# vsoInsertAllParams

## Description
Inserts all parameters of the plug-in object as widgets to appear in the Object Info Palette.

```pascal
FUNCTION vsoInsertAllParams : BOOLEAN;
```

```python

def vs.vsoInsertAllParams():
    return BOOLEAN
```

## Version
Availability: from Vectorworks 2011
## Category
* Object Events